export default function PrivacyPolicy() {
  return (
    <section className="bg-w3 px-[20px] py-[16px]">
      <h3 className="text-sm text-b1 font-semibold tracking-[-0.02em]">개인정보 처리방침</h3>
      <div className="mt-[12px] w-full h-[128px] overflow-y-scroll rounded-lg border border-w4 bg-white p-[12px] ">
        [1. 수집하는 개인정보 항목] - 회원 가입 시: 이메일, 닉네임, 비밀번호 - 서비스 이용 시: IP 주소, 접속 기록, 후기
        작성 내용 등
        <br />
        [2. 개인정보 수집 및 이용 목적] - 회원 관리: 본인 확인, 서비스 이용 이력 관리 - 서비스 제공: 후기 등록,
        마이페이지 구성 등 개인화 기능 - 통계 및 분석: 서비스 개선 및 맞춤 콘텐츠 제공
        <br />
        [3. 개인정보의 보유 및 이용기간] - 회원 탈퇴 시까지 보관하며, 이후에는 관련 법령에 따라 일정 기간 보관 후
        파기됩니다. - 단, 부정 이용 방지 목적의 최소한의 정보(IP, 탈퇴 이력 등)는 6개월간 보관됩니다.
        <br />
        [4. 개인정보의 제3자 제공] 회사는 원칙적으로 개인정보를 외부에 제공하지 않으며, 아래의 경우에만 예외로 합니다: -
        이용자가 사전에 동의한 경우 - 법령에 의거해 요청받은 경우
        <br />
        [5. 개인정보 파기 절차 및 방법] - 전자적 파일: 복구 불가능한 방식으로 완전 삭제 - 종이 문서: 분쇄 또는 소각
        <br />
        [6. 이용자의 권리] - 언제든지 자신의 개인정보를 조회, 수정, 삭제할 수 있습니다. - 마이페이지 또는 고객센터를
        통해 요청 가능합니다.
        <br />
        [7. 개인정보 보호책임자] 이름: 홍길동 연락처: privacy@example.com
      </div>
    </section>
  );
}
