export default function TermsOfService() {
  return (
    <section className="bg-w3 px-[20px] py-[16px]">
      <h3 className="text-sm text-b1 font-semibold tracking-[-2%]">서비스 이용약관</h3>
      <div className="mt-[12px] w-full h-[128px] overflow-y-scroll rounded-lg border border-w4 bg-white p-[12px] ">
        [제1조 목적] 본 약관은 쉼표가 제공하는 관광지 정보 및 후기 공유 서비스(이하 ‘서비스’)의 이용과 관련하여 회사와
        회원 간의 권리, 의무 및 책임사항 등을 규정함을 목적으로 합니다.
        <br />
        [제2조 정의] 1. ‘회원’이란 본 약관에 동의하고 회사가 제공하는 서비스를 이용하는 자를 말합니다. 2. ‘콘텐츠’란
        회원이 서비스 내에 게시한 후기, 이미지 등을 포함합니다.
        <br />
        [제3조 서비스의 제공] 쉼표는 다음과 같은 서비스를 제공합니다: 1. 국내 웰니스 관광지 정보 제공 2. 관광지 후기
        작성 및 열람 3. 관련 지도, 경로 안내, 태그 등 부가 정보 제공
        <br />
        [제4조 회원의 의무] 1. 회원은 사실에 기반한 내용을 작성해야 하며, 타인의 권리를 침해해서는 안 됩니다. 2. 서비스
        이용 시 관계 법령 및 공공질서를 준수해야 합니다.
        <br />
        [제5조 게시물의 관리] 관리자는 회원이 작성한 콘텐츠가 다음의 경우 사전 통지 없이 삭제하거나 노출을 제한할 수
        있습니다: 1. 허위 정보 또는 광고성 게시물 2. 욕설, 비방 등 타인을 불쾌하게 하는 내용 3. 불법 촬영물, 음란물 등
        법령 위반 게시물
        <br />
        [제6조 계약 해지] 회원은 언제든지 서비스 내 설정을 통해 탈퇴를 신청할 수 있으며, 관련 법령에 따라 처리합니다.
      </div>
    </section>
  );
}
